HenryHet2D/transient/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
20000
(
(8.10446e-05 0 -1.50446e-05)
(9.11863e-05 0 4.903e-06)
(7.23615e-05 0 1.39217e-05)
(4.46409e-05 0 1.37988e-05)
(2.23122e-05 0 8.52992e-06)
(1.00959e-05 0 3.68632e-06)
(5.2392e-06 0 1.1704e-06)
(3.92801e-06 0 1.40785e-07)
...
)
;

boundaryField
{
    left
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
100
(
(8.10446e-05 0 -1.50446e-05)
(5.5681e-05 0 -1.97702e-05)
(5.96895e-05 0 -3.14065e-06)
(8.34042e-05 0 -1.42344e-05)
(7.8233e-05 0 -4.38716e-05)
(5.24778e-05 0 -4.25823e-05)
(4.48248e-05 0 -7.88483e-06)
(6.07997e-05 0 1.84907e-05)
...
)
;
    }
    right
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
100
(
(-0.00137036 0 0.000161984)
(-0.000103611 0 0.000275246)
(-6.65352e-05 0 0.000224095)
(-0.000115137 0 0.000235796)
(-0.000150655 0 0.000249809)
(-0.000270008 0 0.000253584)
(-0.00079867 0 0.000343063)
(-0.00155177 0 0.000764355)
...
)
;
    }
    bottom
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(8.10446e-05 0 -1.50446e-05)
(9.11863e-05 0 4.903e-06)
(7.23615e-05 0 1.39217e-05)
(4.46409e-05 0 1.37988e-05)
(2.23122e-05 0 8.52992e-06)
(1.00959e-05 0 3.68632e-06)
(5.2392e-06 0 1.1704e-06)
(3.92801e-06 0 1.40785e-07)
...
)
;
    }
    top
    {
        type            extrapolatedCalculated;
        value           nonuniform List<vector> 
200
(
(0.000113238 0 4.7238e-05)
(0.000164585 0 4.10894e-06)
(0.00015412 0 -1.45737e-05)
(0.000119317 0 -2.02299e-05)
(8.03931e-05 0 -1.86936e-05)
(4.87182e-05 0 -1.29813e-05)
(2.86215e-05 0 -7.11538e-06)
(1.81791e-05 0 -3.32698e-06)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
