HenryHet2D/transient/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
20000
(
10032.2
10032
10031.7
10031.4
10031
10030.6
10030.1
10029.6
...
)
;

boundaryField
{
    left
    {
        type            darcyFixedVelocity;
        gradient        uniform 0;
        velocity        6.6e-05;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            darcyFixedVelocity;
        gradient        uniform 0;
        velocity        0;
    }
    top
    {
        type            darcyFixedVelocity;
        gradient        uniform 0;
        velocity        0;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
