HenryHet2D/transient/0/K
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
20000
(
(6.72812e-09 0 0 6.72812e-09 0 6.72812e-09)
(4.52648e-09 0 0 4.52648e-09 0 4.52648e-09)
(2.50253e-09 0 0 2.50253e-09 0 2.50253e-09)
(1.21866e-09 0 0 1.21866e-09 0 1.21866e-09)
(5.45873e-10 0 0 5.45873e-10 0 5.45873e-10)
(2.33164e-10 0 0 2.33164e-10 0 2.33164e-10)
(1.05465e-10 0 0 1.05465e-10 0 1.05465e-10)
(6.23821e-11 0 0 6.23821e-11 0 6.23821e-11)
...
)
;

boundaryField
{
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
